a = ['','один', "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
b = ["", 'сто', "двести", "тристо", "четыресто", "пятьсот", "шестьсот", "семьиот", "восемьсот", "девятьсот"]
c = ['десять', "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семьнадцать","восемьнадцать", "девятнадцать"]
d = ["","", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девятосто"]
value = int(input("Enter value: "))
i = value//100
if value%100 >=10 and value%100<20:
    x = value%10
    print(b[i], c[x])
else:
    x = value%100//10
    y = value%10
    print(b[i], d[x], a[y])